/*********************************************************************************************************************
 * -*-encoding: GB2312
 * 
 * @file       		main.c
 * @author     		智能车实验室
 * @version    		v1.0
 * @Software 		MDK FOR C51 V9.60
 * @Target core		STC8A8K64S4
 * @date       		2020-9-21
 * @note			延时实现闪烁灯
 ********************************************************************************************************************/

#include "headfile.h"


void main()
{
	DisableGlobalIRQ();		// 关闭总中断
	board_init();			// 全局初始化
	EnableGlobalIRQ();		// 开启总中断
    while(1)
	{
		pca_delay_ms(2000);	// 延时500ms
		P52 = !P52;			// IO电平翻转
    }
}












